Autodesk.Revit.DB.UnitFormatUtils.TryParse(Autodesk.Revit.DB.Units,Autodesk.Revit.DB.UnitType,System.String,System.Double@,System.String@)
Parses a formatted string into a number with units if possible.
units:
The units formatting settings, typically obtained from Document.GetUnits().
unitType:
The target unit type for the value.
stringToParse:
The string to parse.
value:
The parsed value, in Revit's internal units.  Ignore this value if the function returns false.
message:
A localized message that, if the parsing fails, explains the reason for failure.
Returns:
True if the string can be parsed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitFormatUtils.TryParse(Autodesk.Revit.DB.Units,Autodesk.Revit.DB.UnitType,System.String,System.Double@)
Parses a formatted string into a number with units if possible.
units:
The units formatting settings, typically obtained from Document.GetUnits().
unitType:
The target unit type for the value.
stringToParse:
The string to parse.
value:
The parsed value, in Revit's internal units.  Ignore this value if the function returns false.
Returns:
True if the string can be parsed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitFormatUtils.TryParse(Autodesk.Revit.DB.Units,Autodesk.Revit.DB.UnitType,System.String,Autodesk.Revit.DB.ValueParsingOptions,System.Double@,System.String@)
Parses a formatted string into a number with units if possible.
units:
The units formatting settings, typically obtained from Document.GetUnits().
unitType:
The target unit type for the value.
stringToParse:
The string to parse.
valueParsingOptions:
Additional parsing options.
value:
The parsed value, in Revit's internal units.  Ignore this value if the function returns false.
message:
A localized message that, if the parsing fails, explains the reason for failure.
Returns:
True if the string can be parsed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
-or-
The display unit in the FormatOptions in valueParsingOptions is not a valid display unit for unitType.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitFormatUtils.TryParse(Autodesk.Revit.DB.Units,Autodesk.Revit.DB.UnitType,System.String,Autodesk.Revit.DB.ValueParsingOptions,System.Double@)
Parses a formatted string into a number with units if possible.
units:
The units formatting settings, typically obtained from Document.GetUnits().
unitType:
The target unit type for the value.
stringToParse:
The string to parse.
valueParsingOptions:
Additional parsing options.
value:
The parsed value, in Revit's internal units.  Ignore this value if the function returns false.
Returns:
True if the string can be parsed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
-or-
The display unit in the FormatOptions in valueParsingOptions is not a valid display unit for unitType.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitFormatUtils.Format(Autodesk.Revit.DB.Units,Autodesk.Revit.DB.UnitType,System.Double,System.Boolean,System.Boolean)
Formats a number with units into a string.
units:
The units formatting settings, typically obtained from Document.GetUnits().
unitType:
The unit type of the value to format.
value:
The value to format, in Revit's internal units.
maxAccuracy:
True if the value should be rounded to an increased accuracy level appropriate for editing or understanding the precise value stored in the model.  False if the accuracy specified by the FormatOptions should be used, appropriate for printed drawings.
forEditing:
True if the formatting should be modified as necessary so that the formatted string can be successfully parsed, for example by suppressing digit grouping.  False if unmodified settings should be used, suitable for display only.
Returns:
The formatted string.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
-or-
The given value for value is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitFormatUtils.Format(Autodesk.Revit.DB.Units,Autodesk.Revit.DB.UnitType,System.Double,System.Boolean,System.Boolean,Autodesk.Revit.DB.FormatValueOptions)
Formats a number with units into a string.
units:
The units formatting settings, typically obtained from Document.GetUnits().
unitType:
The unit type of the value to format.
value:
The value to format, in Revit's internal units.
maxAccuracy:
True if the value should be rounded to an increased accuracy level appropriate for editing or understanding the precise value stored in the model.  False if the accuracy specified by the FormatOptions should be used, appropriate for printed drawings.
forEditing:
True if the formatting should be modified as necessary so that the formatted string can be successfully parsed, for example by suppressing digit grouping.  False if unmodified settings should be used, suitable for display only.
formatValueOptions:
Additional formatting options.
Returns:
The formatted string.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
-or-
The given value for value is not finite
-or-
The display unit in the FormatOptions in formatValueOptions is not a valid display unit for unitType.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitFormatUtils
A utility class for formatting and parsing numbers with units.
Since:
2014